In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import datetime as dt

In [4]:
df =pd.read_csv("data/bank_data_project.csv")

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1041614 entries, 0 to 1041613
Data columns (total 9 columns):
 #   Column                   Non-Null Count    Dtype
---  ------                   --------------    -----
 0   TransactionID            1041614 non-null  object
 1   CustomerID               1041614 non-null  object
 2   CustomerDOB              1041614 non-null  object
 3   CustGender               1041614 non-null  object
 4   CustLocation             1041614 non-null  object
 5   CustAccountBalance       1041614 non-null  float64
 6   TransactionDate          1041614 non-null  object
 7   TransactionTime          1041614 non-null  int64
 8   TransactionAmount (INR)  1041614 non-null  float64
dtypes: float64(2), int64(1), object(6)
memory usage: 71.5+ MB

In [8]:
print(df["CustomerDOB"].head(30).tolist())

['10/01/1994', '04/04/1957', '26/11/1996', '14/09/1973', '24/03/1988', '08/10/1972', '26/01/1992', '27/01/1982', '19/04/1988', '22/06/1984', '22/07/1982', '07/07/1988', '13/06/1978', '05/01/1992', '24/03/1978', '10/07/1968', '1/1/1800', '16/07/1989', '11/01/1991', '24/06/1985', '20/04/1993', '31/08/1989', '1/1/1800', '01/10/1986', '17/05/1991', '24/02/1993', '01/02/1986', '01/04/1993', '1/1/1800', '21/01/1967']

In [9]:
df.head()

,TransactionID,CustomerID,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR)
0,T1,C5841053,10/01/1994,F,JAMSHEDPUR,17819.05,02/08/2016,143207,25.0
1,T2,C2142763,04/04/1957,M,JHAJJAR,2270.69,02/08/2016,141858,27999.0
2,T3,C4417068,26/11/1996,F,MUMBAI,17874.44,02/08/2016,142712,459.0
3,T4,C5342380,14/09/1973,F,MUMBAI,866503.21,02/08/2016,142714,2060.0
4,T5,C9031234,24/03/1988,F,NAVI MUMBAI,6714.43,02/08/2016,181156,1762.5

In [30]:
# Convert to datetime if needed
df["TransactionDate"] = pd.to_datetime(df["TransactionDate"], errors='coerce')
unique_dates = df["TransactionDate"].unique()
print(unique_dates)

<DatetimeArray>
['2016-02-08 00:00:00', '2016-01-08 00:00:00', '2016-03-08 00:00:00',
 '2016-05-08 00:00:00', '2016-04-08 00:00:00', '2016-06-08 00:00:00',
 '2016-09-08 00:00:00', '2016-08-08 00:00:00', '2016-12-08 00:00:00',
 '2016-07-08 00:00:00',                 'NaT', '2016-10-08 00:00:00',
 '2016-11-08 00:00:00', '2016-03-09 00:00:00', '2016-02-09 00:00:00',
 '2016-01-09 00:00:00', '2016-06-09 00:00:00', '2016-05-09 00:00:00',
 '2016-04-09 00:00:00', '2016-09-09 00:00:00', '2016-08-09 00:00:00',
 '2016-07-09 00:00:00', '2016-12-09 00:00:00', '2016-11-09 00:00:00',
 '2016-10-09 00:00:00']
Length: 25, dtype: datetime64[ns]

In [10]:
# Convert to datetime if needed
df["CustomerDOB"] = pd.to_datetime(df["CustomerDOB"], errors='coerce')
unique_dates = df["CustomerDOB"].unique()
print(unique_dates)

<DatetimeArray>
['1994-10-01 00:00:00', '1957-04-04 00:00:00',                 'NaT',
 '1972-08-10 00:00:00', '1988-07-07 00:00:00', '1992-05-01 00:00:00',
 '1968-10-07 00:00:00', '1800-01-01 00:00:00', '1991-11-01 00:00:00',
 '1986-01-10 00:00:00',
 ...
 '1998-04-02 00:00:00', '1959-09-03 00:00:00', '1998-02-06 00:00:00',
 '1957-08-05 00:00:00', '1965-10-02 00:00:00', '2004-07-03 00:00:00',
 '1945-07-06 00:00:00', '1954-09-06 00:00:00', '1946-06-04 00:00:00',
 '1950-07-01 00:00:00']
Length: 7062, dtype: datetime64[ns]

In [11]:
 #Check for invalid dates (NaT values)
invalid_dates = df[df["CustomerDOB"].isna()]
print(f"Number of invalid dates: {len(invalid_dates)}")
print("Invalid entries:")
print(invalid_dates)

Number of invalid dates: 560396
Invalid entries:
        TransactionID CustomerID CustomerDOB CustGender   CustLocation  \
2                  T3   C4417068         NaT          F         MUMBAI
3                  T4   C5342380         NaT          F         MUMBAI
4                  T5   C9031234         NaT          F    NAVI MUMBAI
6                  T7   C7126560         NaT          F         MUMBAI
7                  T8   C1220223         NaT          M         MUMBAI
...               ...        ...         ...        ...            ...
1041607      T1048561   C5028150         NaT          M           PUNE
1041608      T1048562   C1034220         NaT          M      BANGALORE
1041610      T1048564   C6459278         NaT          M         NASHIK
1041611      T1048565   C6412354         NaT          M      HYDERABAD
1041612      T1048566   C6420483         NaT          M  VISAKHAPATNAM

         CustAccountBalance TransactionDate  TransactionTime  \
2                  17874.44      02/08/2016           142712
3                 866503.21      02/08/2016           142714
4                   6714.43      02/08/2016           181156
6                    973.46      02/08/2016           173806
7                  95075.54      02/08/2016           170537
...                     ...             ...              ...
1041607              464.87      18/09/2016           184632
1041608             1212.70      18/09/2016           184734
1041610            27311.42      18/09/2016           183734
1041611           221757.06      18/09/2016           183313
1041612            10117.87      18/09/2016           184706

         TransactionAmount (INR)
2                          459.0
3                         2060.0
4                         1762.5
6                          566.0
7                          148.0
...                          ...
1041607                   3000.0
1041608                   1500.0
1041610                    460.0
1041611                    770.0
1041612                   1000.0

[560396 rows x 9 columns]

In [12]:
# Count NaT values
nat_count = df["CustomerDOB"].isna().sum()
total_count = len(df)
print(f"Invalid dates (NaT): {nat_count}")
print(f"Total rows: {total_count}")
print(f"Percentage invalid: {(nat_count/total_count)*100:.2f}%")

Invalid dates (NaT): 560396
Total rows: 1041614
Percentage invalid: 53.80%

In [13]:
# Check what the original date values actually look like
print("Sample of original CustomerDOB values that became NaT:")
original_dob_sample = df.loc[df["CustomerDOB"].isna(), "CustomerDOB"].head(20)
print(original_dob_sample.tolist())

# Or if you have the original data before conversion, check that

Sample of original CustomerDOB values that became NaT:
[NaT, NaT, NaT, NaT, NaT, NaT, NaT, NaT, NaT, NaT, NaT, NaT, NaT, NaT, NaT, NaT, NaT, NaT, NaT, NaT]

In [31]:
df["CustomerDOB"] = df["CustomerDOB"].bfill()

In [32]:
# Convert to datetime if needed
df["CustomerDOB"] = pd.to_datetime(df["CustomerDOB"], errors='coerce')
unique_dates = df["CustomerDOB"].unique()
print(unique_dates)

<DatetimeArray>
['1994-10-01 00:00:00', '1957-04-04 00:00:00', '1972-08-10 00:00:00',
 '1988-07-07 00:00:00', '1992-05-01 00:00:00', '1968-10-07 00:00:00',
 '1800-01-01 00:00:00', '1991-11-01 00:00:00', '1986-01-10 00:00:00',
 '1986-01-02 00:00:00',
 ...
 '1998-04-02 00:00:00', '1959-09-03 00:00:00', '1998-02-06 00:00:00',
 '1957-08-05 00:00:00', '1965-10-02 00:00:00', '2004-07-03 00:00:00',
 '1945-07-06 00:00:00', '1954-09-06 00:00:00', '1946-06-04 00:00:00',
 '1950-07-01 00:00:00']
Length: 7061, dtype: datetime64[ns]

In [33]:
# Convert to datetime 
print(df["CustomerDOB"])

0         1994-10-01
1         1957-04-04
2         1972-08-10
3         1972-08-10
4         1972-08-10
             ...
1041609   1990-08-04
1041610   1984-05-03
1041611   1984-05-03
1041612   1984-05-03
1041613   1984-05-03
Name: CustomerDOB, Length: 1041614, dtype: datetime64[ns]

In [34]:
# Count NaT values
nat_count = df["CustomerDOB"].isna().sum()
total_count = len(df)
print(f"Invalid dates (NaT): {nat_count}")
print(f"Total rows: {total_count}")
print(f"Percentage invalid: {(nat_count/total_count)*100:.2f}%")

Invalid dates (NaT): 0
Total rows: 1041614
Percentage invalid: 0.00%

In [35]:
df.head()

,TransactionID,CustomerID,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR)
0,T1,C5841053,1994-10-01,F,JAMSHEDPUR,17819.05,2016-02-08,143207,25.0
1,T2,C2142763,1957-04-04,M,JHAJJAR,2270.69,2016-02-08,141858,27999.0
2,T3,C4417068,1972-08-10,F,MUMBAI,17874.44,2016-02-08,142712,459.0
3,T4,C5342380,1972-08-10,F,MUMBAI,866503.21,2016-02-08,142714,2060.0
4,T5,C9031234,1972-08-10,F,NAVI MUMBAI,6714.43,2016-02-08,181156,1762.5

In [36]:
df.describe()

,CustomerDOB,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR)
count,1041614,1.041614e+06,538378,1.041614e+06,1.041614e+06
mean,1963-09-24 01:54:37.317700992,1.149986e+05,2016-06-24 11:52:07.540872448,1.571221e+05,1.566096e+03
min,1800-01-01 00:00:00,0.000000e+00,2016-01-08 00:00:00,0.000000e+00,0.000000e+00
25%,1977-10-02 00:00:00,4.728140e+03,2016-04-08 00:00:00,1.240410e+05,1.600000e+02
50%,1986-05-10 00:00:00,1.676852e+04,2016-07-08 00:00:00,1.642470e+05,4.575000e+02
75%,1990-11-02 00:00:00,5.742885e+04,2016-10-08 00:00:00,2.000220e+05,1.200000e+03
max,2029-06-05 00:00:00,1.150355e+08,2016-12-09 00:00:00,2.359590e+05,1.560035e+06
std,NaN,8.467609e+05,NaN,5.126352e+04,6.561464e+03

In [37]:
print(df['CustomerDOB'])

0         1994-10-01
1         1957-04-04
2         1972-08-10
3         1972-08-10
4         1972-08-10
             ...
1041609   1990-08-04
1041610   1984-05-03
1041611   1984-05-03
1041612   1984-05-03
1041613   1984-05-03
Name: CustomerDOB, Length: 1041614, dtype: datetime64[ns]

In [38]:
print(df["CustomerDOB"].head(30).tolist())

[Timestamp('1994-10-01 00:00:00'), Timestamp('1957-04-04 00:00:00'), Timestamp('1972-08-10 00:00:00'), Timestamp('1972-08-10 00:00:00'), Timestamp('1972-08-10 00:00:00'), Timestamp('1972-08-10 00:00:00'), Timestamp('1988-07-07 00:00:00'), Timestamp('1988-07-07 00:00:00'), Timestamp('1988-07-07 00:00:00'), Timestamp('1988-07-07 00:00:00'), Timestamp('1988-07-07 00:00:00'), Timestamp('1988-07-07 00:00:00'), Timestamp('1992-05-01 00:00:00'), Timestamp('1992-05-01 00:00:00'), Timestamp('1968-10-07 00:00:00'), Timestamp('1968-10-07 00:00:00'), Timestamp('1800-01-01 00:00:00'), Timestamp('1991-11-01 00:00:00'), Timestamp('1991-11-01 00:00:00'), Timestamp('1800-01-01 00:00:00'), Timestamp('1800-01-01 00:00:00'), Timestamp('1800-01-01 00:00:00'), Timestamp('1800-01-01 00:00:00'), Timestamp('1986-01-10 00:00:00'), Timestamp('1986-01-02 00:00:00'), Timestamp('1986-01-02 00:00:00'), Timestamp('1986-01-02 00:00:00'), Timestamp('1993-01-04 00:00:00'), Timestamp('1800-01-01 00:00:00'), Timestamp('1800-01-01 00:00:00')]

In [39]:
df[df["CustomerDOB"].dt.year == 1800]

,TransactionID,CustomerID,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR)
16,T17,C1376215,1800-01-01,M,MUMBAI,77495.15,2016-01-08,124727,1423.11
19,T20,C8999019,1800-01-01,M,PUNE,10643.50,2016-01-08,152821,945.00
20,T21,C6121429,1800-01-01,M,NO 3 KALYANI NAGAR PUNE,2934.22,2016-01-08,152824,36.00
21,T22,C4511244,1800-01-01,F,SECUNDERABAD,4470.15,2016-03-08,105329,27.00
22,T23,C7018081,1800-01-01,M,WAYS PANCHKUVA AHMEDABAD,143.07,2016-03-08,104718,110.00
...,...,...,...,...,...,...,...,...,...
1041578,T1048532,C6937679,1800-01-01,M,NEW DELHI,50698.90,NaT,184319,598.86
1041579,T1048533,C3422316,1800-01-01,F,BARODA,91662.32,NaT,183750,800.00
1041580,T1048534,C7431884,1800-01-01,M,MANDIR DHANBAD,53771.64,NaT,184049,520.00
1041586,T1048540,C7411577,1800-01-01,F,BANGALORE,10662.67,NaT,182350,695.00
1041587,T1048541,C1528025,1800-01-01,M,MUMBAI,230894.59,NaT,182331,290.00

In [40]:
df[df['CustomerDOB'].dt.year == 1800].shape

(121197, 9)

In [41]:
df.loc[df['CustomerDOB'].dt.year == 1800, 'CustomerDOB'] = pd.Timestamp('2020-01-01')

In [42]:
df['CustomerDOB'].head(30)

0    1994-10-01
1    1957-04-04
2    1972-08-10
3    1972-08-10
4    1972-08-10
5    1972-08-10
6    1988-07-07
7    1988-07-07
8    1988-07-07
9    1988-07-07
10   1988-07-07
11   1988-07-07
12   1992-05-01
13   1992-05-01
14   1968-10-07
15   1968-10-07
16   2020-01-01
17   1991-11-01
18   1991-11-01
19   2020-01-01
20   2020-01-01
21   2020-01-01
22   2020-01-01
23   1986-01-10
24   1986-01-02
25   1986-01-02
26   1986-01-02
27   1993-01-04
28   2020-01-01
29   2020-01-01
Name: CustomerDOB, dtype: datetime64[ns]